package src.main.homeworks.hw6;

/*1. Створити порожній проект у IntelliJ IDEA, створити клас HomeWorkApp і прописати в ньому метод main().*/
public class HomeWorkApp {
    public static void main(String[] args) {
        /*2. Створіть метод printThreeWords(), який під час виклику
        * повинен надрукувати в стовпець у три слова: Orange, Banana, Apple.*/
        HW6Service.printThreeWords();

        /*3. Створіть метод checkSumSign(), у тілі якого оголосіть дві int змінні a і b,
        та ініціалізуйте їх будь-якими значеннями, якими захочете. Далі метод повинен підсумувати ці змінні,
        і якщо їх сума більша або дорівнює 0, то вивести в консоль повідомлення "Сума позитивна",
        інакше - "Сума негативна";*/
        HW6Service.checkSumSign();

        /*4. Створіть метод printColor() у тілі якого задайте int змінну value та ініціалізуйте її будь-яким значенням.
        Якщо значення менше 0 (0 включно), то в консоль метод повинен вивести повідомлення "Червоний",
        якщо лежить в межах від 0 (0 виключно) до 100 (100 включно), то "Жовтий",
        якщо більше 100 (100 виключно) - "Зелений";*/
        HW6Service.printColor();

        /*5. Створіть метод compareNumbers(), у тілі якого оголосіть дві int змінні a і b,
        та ініціалізуйте їх будь-якими значеннями, якими захочете. Якщо a більше або одно b,
        необхідно вивести в консоль повідомлення “a >= b”, інакше “a < b”;*/
        HW6Service.compareNumbers();

        /*6. Написати метод, який приймає на вхід два цілих числа і перевіряє, що їхня сума
        лежить в межах від 10 до 20 (включно), якщо так – повернути true, інакше – false.*/
        System.out.println(HW6Service.isSumInRange(7, 6));

        /*7. Написати метод, якому як параметр передається ціле число, метод повинен надрукувати в консоль,
        чи додатнє число передали або від’ємне. Примітка: нуль вважаємо позитивним числом.*/
        HW6Service.checkPositiveOrNegative(-9);

        /*8. Написати метод, якому як параметр передається ціле число. Метод повинен повернути true,
        якщо число є негативним, і повернути false якщо позитивне.*/
        System.out.println(HW6Service.isNegative(15));

        /*9. Написати метод, якому як аргументи передається рядок і число, метод повинен
        надрукувати в консоль зазначений рядок, вказану кількість разів;*/
        HW6Service.printStringMultipleTimes("Hello, world!", 3);

        /*10. * Написати метод, який визначає, чи є рік високосним, і повертає boolean
        (високосний – true, не високосний – false). Кожен 4-й рік є високосним, крім кожного 100-го,
        причому кожен 400-й – високосний.*/
        System.out.println(HW6Service.isLeapYear(1600));
    }
}
